var SHIP_DATA = {
    "shipName": "Корабль pro 3000",
    "shipDescription": "Британский трансатлантический пароход, второй лайнер класса «Олимпик». Строился в Белфасте на верфи «Харленд энд Вулф» с 1909 по 1912 год по заказу судоходной компании «Уайт Стар Лайн». ",
    "x": 0,
    "y": 0,
    "shipParts": [
        [
            {
                "name": "Грузовой отсек",
                "model": "0_1.json",
                "description": "Тут хранится топливо и песок.",
                "tx": -30,
                "ty": -15,
                "tz": 0
            },
            {
                "name": "Реактор",
                "model": "0_2.json",
                "description": "Опасная зона.",
                "tx": 30,
                "ty": -15,
                "tz": 0
            }
        ],

        [
            {
                "name": "Оружейная",
                "model": "1_1.json",
                "description": "Очень опасно.",
                "tx": -30,
                "ty": -10,
                "tz": 0
            },
            {
                "name": "кабина пилота",
                "model": "1_2.json",
                "description": "Тут пилот.",
                "tx": 30,
                "ty": -10,
                "tz": 0
            }
        ],

        [
            {
                "name": "Помойка",
                "model": "2_1.json",
                "description": "Ничего полезного.",
                "tx": -40,
                "ty": -5,
                "tz": 5
            },
            {
                "name": "Столовая",
                "model": "2_2.json",
                "description": "тестовые данные.",
                "tx": -40,
                "ty": -5,
                "tz": -5
            },
            {
                "name": "Прачечная",
                "model": "2_3.json",
                "description": "Есть 2 стиральные машинки.",
                "tx": -10,
                "ty": -5,
                "tz": 0
            },
            {
                "name": "Спальня",
                "model": "2_4.json",
                "description": "На 30 мест.",
                "tx": 30,
                "ty": -10,
                "tz": 0
            }
        ],

        [
            {
                "name": "Палуба",
                "model": "3_1.json",
                "description": "Контента, просмотра шрифтов, абзацев, отступов и на сайтах и смысловую нагрузку. Средневековый книгопечатник вырвал отдельные фразы и даже. Создающие собственные варианты текста сыграет на сайтах. Наиболее распространенных слов даже с использованием lorem знаменитый lorem текст-рыбу широко. Слова, получив текст-рыбу, широко используемый и на кириллице значительно. Рыбным текстом является знаменитый lorem обитателям водоемов слова получив. Вариантов lorem или иные буквы встречаются. " +
                "Кириллице значительно различается используется он веб-дизайнерами. Именно из его трактата о пределах добра и. Как цель применения такого текста исключительно демонстрационная. Распространенных слов оценке качества восприятия макета наиболее распространенных. Сайтах и зла средневековый книгопечатник вырвал отдельные. Именно из его трактата о пределах добра. Применили в xvi веке те или иные буквы встречаются. Или иные буквы встречаются с использованием lorem ipsum на латыни.",
                "tx": 0,
                "ty": 0,
                "tz": 0
            },
        ],

        [
            {
                "name": "Смотровая",
                "model": "4_1.json",
                "description": "На пять человек",
                "tx": -10,
                "ty": 0,
                "tz": 0
            },
            {
                "name": "Будка",
                "model": "4_2.json",
                "description": "Ничего интересного",
                "tx": 55,
                "ty": 0,
                "tz": 0
            }
        ],

        [
            {
                "name": "Кухня",
                "model": "5_1.json",
                "description": "Готовят вкусно",
                "tx": -15,
                "ty": 5,
                "tz": 0
            },
            {
                "name": "Склад",
                "model": "5_2.json",
                "description": "Очень большой",
                "tx": 55,
                "ty": 5,
                "tz": 0
            }
        ],

        [
            {
                "name": "Тест",
                "model": "6_1.json",
                "description": "тестеттет йцтктйткт цйтуйтуй",
                "tx": -15,
                "ty": 10,
                "tz": 0
            }
        ]
    ]
};